In [2]:
import nltk
import csv
from nltk.corpus import stopwords
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [3]:
stop_words = set(stopwords.words("english"))

In [4]:
print("yes")

yes

In [8]:
dataset = pd.read_csv(r'reviews_ioCombined.csv')

In [9]:
dataset

,AUTHOR,COMMENT,RATING,TIME
0,Elizabeth Lowes,“\nI asked for a charge back of £38.47.. for a...,1,Posted 1 day ago
1,Anonymous,“\nOnly thing worse than being a Natwest custo...,1,Posted 1 week ago
2,Anonymous,“\nInformed them online I was going to Japan f...,1,Posted 1 week ago
3,Mrs Elizabeth Lowes,“\nNatwest accused me of charge back fraud aft...,1,Posted 2 weeks ago
4,Mrs Elizabeth Lowes,“\nWorst bank ever l got a very rude insulting...,1,Posted 2 weeks ago
...,...,...,...,...
335,Ben Conway,“\nAwful customer service NatWest Help Oxford ...,1,Posted 8 years ago
336,Genna,“\nDefinitely fell in love with the man on the...,5,Posted 8 years ago
337,Jo Tillott,“\n£16.00 to call NatWest Help about a simple ...,1,Posted 8 years ago
338,Skywalker,“\nI forgot how much I actually dislike Natwes...,1,Posted 8 years ago
339,Leanna Lawson,“\nhave just had amazing customer service from...,5,Posted 8 years ago